#include "stepper.h"

// 这里设置步进电机旋转一圈是多少步
#define STEPS 100

//设置步进电机的步数和引脚（就是注意点2里面说的驱动板上IN1～IN4连接的四个数字口）。
Stepper stepper(STEPS, 12, 14, 13, 15);

//****************************************************
//初始化Stepper
//****************************************************
void Init_Stepper()
{
  // 设置电机的转速：每分钟为360步
  stepper.setSpeed(360);
}


//****************************************************
//Stepper顺转
//****************************************************
void Stepper_Clockwise()
{
  
  Serial.println("shun");
  stepper.step(-720); //4步模式下旋转一周用2048 步。
  
} 

//****************************************************
//Stepper逆转
//****************************************************
void Stepper_Anticlockwise()
{
  Serial.println("ni");
  stepper.step(360); //4步模式下旋转一周用2048 步。    
} 

